In [1]:
person = {
    "first": ["Corey", "Omer", "Maryam", "Omer"],
    "last": ["Shafter", "Shehzad","Rana","Shapoki"],
    "email":["cs@gmail.com", "os@gmail.com", "mr@gmail.com","oshapoki@gmail.com"]
}

In [2]:
import pandas as pd

df = pd.DataFrame(person)
df

    first     last               email
0   Corey  Shafter        cs@gmail.com
1    Omer  Shehzad        os@gmail.com
2  Maryam     Rana        mr@gmail.com
3    Omer  Shapoki  oshapoki@gmail.com

In [3]:
df.columns = ['first name', 'last name', 'email']
df.columns = [x.upper() for x in df.columns]
df

  FIRST NAME LAST NAME               EMAIL
0      Corey   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [4]:
df.columns = df.columns.str.replace(' ', '_')
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name               email
0      Corey   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [5]:
df1 = df.rename(columns={'first_name': 'first', 'last_name': 'last'})
df1

    first     last               email
0   Corey  Shafter        cs@gmail.com
1    Omer  Shehzad        os@gmail.com
2  Maryam     Rana        mr@gmail.com
3    Omer  Shapoki  oshapoki@gmail.com

In [6]:
# change row = last name
df.loc[2, ['first_name','last_name', 'email']] = ['Maryam', 'Rana', 'mr@gmail.com']
df

  first_name last_name               email
0      Corey   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [7]:
df.loc[0, 'first_name'] = 'Gray'
df

  first_name last_name               email
0       Gray   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [8]:
# The format for loc and iloc is that first it will have rows and columns:
# loc[[row1, row2,...], [col1, col2,...]]

df.iloc[[0,1], [2]]                 # get first 2 rows from email
df.loc[[0,1], ['last_name','email']]     # get first 2 rows from last and email columns

  last_name         email
0   Shafter  cs@gmail.com
1   Shehzad  os@gmail.com

In [9]:
# set index and reset index command - but not needed here:

#df.set_index('email', inplace  = True)
#df.reset_index(drop=True, inplace = True)
#df

In [10]:
# filter rows where name = 'Omer'

name_omer = (df['first_name'] == 'Omer')
df.loc[name_omer, ['email', 'last_name']]

                email last_name
1        os@gmail.com   Shehzad
3  oshapoki@gmail.com   Shapoki

In [11]:
# Ampersand '&' is an 'AND'
#shapokis = ((df['first_name'] == 'Omer') & (df['last_name'] == 'Shapoki'))
#shapokis

# Pipe '|' is an 'OR'
poochies = ((df['first_name'] == 'Omer') | (df['last_name'] == 'Rana'))
df[poochies]

  first_name last_name               email
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [12]:
# convert email to upper case permanently
df['email'] = df['email'].str.upper()
df

  first_name last_name               email
0       Gray   Shafter        CS@GMAIL.COM
1       Omer   Shehzad        OS@GMAIL.COM
2     Maryam      Rana        MR@GMAIL.COM
3       Omer   Shapoki  OSHAPOKI@GMAIL.COM

Apply Function Below:

In [13]:
# apply, reapply, replace
df['email'].apply(len)

0    12
1    12
2    12
3    18
Name: email, dtype: int64

In [14]:
def update_email(email):
    return email.lower()

df['email'] = df['email'].apply(update_email)
df

  first_name last_name               email
0       Gray   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [15]:
# lambda function - same as above
df['email'] = df['email'].apply(lambda x: x.lower())
df

  first_name last_name               email
0       Gray   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [16]:
# Apply on a df:
#len(df.iloc[2,1]) - give length of row 3 and column 1

df.apply(pd.Series.max)

first_name                  Omer
last_name                Shehzad
email         oshapoki@gmail.com
dtype: object

ApplyMap below:

In [17]:
df.map(str.upper)

  first_name last_name               email
0       GRAY   SHAFTER        CS@GMAIL.COM
1       OMER   SHEHZAD        OS@GMAIL.COM
2     MARYAM      RANA        MR@GMAIL.COM
3       OMER   SHAPOKI  OSHAPOKI@GMAIL.COM

In [18]:
df2 = df.copy()
df2['first_name'] = df['first_name'].replace({'Gray': 'Haaland', 'Omer':'Omi'})
df

  first_name last_name               email
0       Gray   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [19]:
df2['full_name'] = df2['first_name'] + ' ' +df2['last_name']
df2

  first_name last_name               email        full_name
0    Haaland   Shafter        cs@gmail.com  Haaland Shafter
1        Omi   Shehzad        os@gmail.com      Omi Shehzad
2     Maryam      Rana        mr@gmail.com      Maryam Rana
3        Omi   Shapoki  oshapoki@gmail.com      Omi Shapoki

In [20]:
df2.drop(columns=['first_name', 'last_name'], inplace=True,errors='ignore')

In [ ]:
df2[['first_name', 'last_name']] =  df2['full_name'].str.split(' ', expand=True)

df2

                email        full_name first_name last_name
0        cs@gmail.com  Haaland Shafter    Haaland   Shafter
1        os@gmail.com      Omi Shehzad        Omi   Shehzad
2        mr@gmail.com      Maryam Rana     Maryam      Rana
3  oshapoki@gmail.com      Omi Shapoki        Omi   Shapoki

In [41]:
df2.loc[len(df2)] = {'first_name': 'RMOS'}
df2

                email        full_name first_name last_name
0        cs@gmail.com  Haaland Shafter    Haaland   Shafter
1        os@gmail.com      Omi Shehzad        Omi   Shehzad
2        mr@gmail.com      Maryam Rana     Maryam      Rana
3  oshapoki@gmail.com      Omi Shapoki        Omi   Shapoki
4                 NaN              NaN       RMOS       NaN
5                 NaN              NaN       RMOS       NaN

In [50]:
# union_all dfa and dfb

# Table A
dfa = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Mary', 'John', 'Sara']
})

# Table B
dfb = pd.DataFrame({
    'id': [2, 3, 4],
    'city': ['Perth', 'Sydney', 'Melbourne']
})

df_union_all = pd.concat([dfa,dfb], ignore_index=True)

df_union = pd.concat([dfa,dfb]).drop_duplicates(ignore_index=True)

df_inner_join = pd.merge(dfa,dfb, how='inner', on='id')

df_left_join = pd.merge(dfa,dfb, how='left', on='id')

df_outer_join = pd.merge(dfa,dfb, how='outer', on='id')

dfb.loc[dfb['city'] == 'Perth']

   id   city
0   2  Perth